{
  "topics": [
    {
      "id": 1,
      "topicName": "start"
    },
    {
      "id": 2,
      "topicName": "webDevelopment"
    },
    {
      "id": 3,
      "topicName": "python"
    },
    {
      "id": 4,
      "topicName": "ava"
    },
    {
      "id": 5,
      "topicName": "rating"
    }
  ],
  "articles": [
    {
      "id": 1,
      "topic": {
        "id": 2,
        "topicName": "webDevelopment"
      },
      "titleName": "Веб-розробка: вчора, сьогодні, завтра",
      "details": "Історія часто цинічно жартує з людськими винаходами: далеко не завжди задумане ставало реальністю, дуже часто реальністю ставало те, що задуманим не було. Схоже, вся історія вебу й відповідно веб-розробки — те, із чого воно все починалося, як розвивалося, куди направлялося й де опинилося тепер, — яскравий приклад цього твердження.",
      "moreDetails": "Переходячи до, ймовірно, найцікавішої складової фронтенду, варто зробити відступ і запитати: а що робить мова програмування на фронтенді взагалі? Тут варто зазначити, що в 1990-х людину, яка займалася веб-сайтом, дуже часто називали веб-майстер, і далеко не завжди це була людина з навичками програмування. Якось на цю тему пожартував Кріс Коєр, засновник css-tricks.com: «Два фронтенд-розробники сидять поруч у барі. Їм ні про що говорити». І це не той випадок, коли хтось пише на React, а інший на Angular. Це радше про те, що один типовий програміст — з алгоритмічним мисленням, якому зручніше згенерувати весь контент динамічно та імперативно, досить лише отримати контейнер, а другий, навпаки, людина, для якої ближчою є семантика елементів, структура контенту, стилі, анімації тощо, тобто декларативний підхід. Якщо говорити про філософію, закладену в HTML, то саме другий підхід є коректнішим, хоч би як дивно це здавалося для декого з розробників сьогодні.",
      "image": "https://miro.medium.com/max/1200/1*pE2fOVDikEUwiQJlh4ggzg.jpeg"
    },
    {
      "id": 2,
      "topic": {
        "id": 1,
        "topicName": "start"
      },
      "titleName": "З чого розпочати свій шлях в IT",
      "details": "Більшість хороших програмістів займаються програмуванням не для того, щоб отримати за це винагороду або публічне визнання, а заради задоволення.",
      "moreDetails": "Вивчення програмування саме собою не може бути метою, бо кожна мова програмування є лише інструментом, який допомагає щось створити і чогось досягти. Тому кожен повинен визначити для себе, чого саме ми хочемо досягати. Створювати круті програми, які покращують життя людей, комп’ютерні ігри чи веб-сайти. Можливо комусь більше до вподоби шукати недоліки в роботі інших людей? А можливо комусь не так важливо що саме робити, аби лише потрапити в цей крутий, модерновий та динамічний світ ІТ-технологій? Тут кожен має відверто признатись собі і обирати відповідні наступні кроки.В більшості випадків таке дослідження обмежується декількома запитами в Google і короткою розмовою з сусідом-програмістом 🙂 але варто підійти до цього питання більш серйозно. В програмуванні є дуже велика кількість різних мов, технологій та напрямів, і слід орієнтуватись що з чим їдять. Також ІТ-сфера є дуже динамічною – різні технології виникаю і зникають, тому не варто витрачати час на ті з них, яким пророкується не дуже світле майбутнє.",
      "image": "https://lgs.lviv.ua/wp-content/uploads/2016/08/how-to-start.jpg"
    },
    {
      "id": 3,
      "topic": {
        "id": 3,
        "topicName": "python"
      },
      "titleName": "Програмування на Python",
      "details": "На сьогодні мова Python є однієї з найбільш поширених та затребуваних у сфері ІТ. ",
      "moreDetails": "Python проста у використанні, та водночас повноцінна мова програмування, що надає набагато більше засобів для структурування і підтримки великих програм, ніж shell. З іншого боку, вона краще за С обробляє помилки, і, будучи мовою дуже високого рівня, має вбудовані типи даних високого рівня, такі як гнучкі масиви і словники, ефективна реалізація яких на C потребує значних витрат часу.\n\nЗавдяки більш загальним типам даних, Python застосовують до більш широкого кола задач, ніж Awk і навіть Perl, у той ж час багато речей на мові Python робляться настільки ж просто.\n\nPython дозволяє розбивати програми на модулі, що потім можуть бути використані в інших програмах. Python поставляється з великою бібліотекою стандартних модулів, які можна використовувати як основу для нових програм або як приклади при вивченні мови. Стандартні модулі надають засоби для роботи з файлами, системними викликами, мережними з'єднаннями і навіть інтерфейсами до різних графічних бібліотек.\n\nPython - інтерпретована мова, що дозволяє заощадити значну кількість часу, що зазвичай витрачається на компіляцію. Інтерпретатор можна використовувати інтерактивно, що дозволяє експериментувати з можливостями мови, писати шаблони програм або тестувати функції при розробці “знизу-вверх”. Він також зручний як настільний калькулятор. Python дозволяє писати дуже компактні й зручні для читання програми. Програми, написані мовою Python, звичайно значно коротші еквівалента на C або C++ з декількох причин:\n\nтипи даних високого рівня дозволять Вам виразити складні операції однією інструкцією;\nгрупування інструкцій виконується за допомогою відступів замість фігурних дужок;\nнемає необхідності в оголошенні змінних;\nPython розширювана мова: знання C дозволяє додавати нові функції, що вбудовуються, або модулі для виконання критичних операцій з максимальною швидкістю або написання інтерфейсу до комерційних бібліотек, доступним тільки у двійковій формі. Інтерпретатор мови Python може бути вбудований у програму, написану на C, і використовувати його як розширення або командну мову для цієї програми. Python використовується в даний час десятками тисяч програмістів в усьому світі, і число людей, що використовують його, швидко зростає, подвоюється і потроюється щороку. Python приваблює користувачів з ряду причин. Він використовується для розробки програм і дозволяє провести розробку набагато швидше, ніж традиційні мови типу C, C++ або Java . Ця мова працює однаково добре на Windows, UNIX, Macintosh, і OS/2, може використовуватися, для легкої розробки як малих додатків чи сценаріїв, так і для розгортання великих програм. Python пропонує доступ до могутнього і легкого у використанні комплекту 29 інструментальних засобів графічного інтерфейсу користувача. Традиційні машинні мови типу C і Pascal мають ряд характеристик, наприклад, сувора типізація, базові типи, складні (і звичайно довгі) цикли, і потреба у великих кількостях кодів для виконання відносно малих задач. Java досить новий, але розділяє більшість характеристик, включених у цей перелік. Програмісти, знайомі з традиційними мовами погодяться, що відсутність суворої типізації полегшує роботу з Python.",
      "image": "https://python-scripts.com/wp-content/uploads/2019/09/python-learn.jpeg"
    },
    {
      "id": 4,
      "topic": {
        "id": 4,
        "topicName": "java"
      },
      "titleName": "Вісім цікавих фактів про Java",
      "details": "Java – об’єктно-орієнтована мова програмування, розроблена компанією Sun Microsystems. Додатки Java зазвичай транслюються в спеціальний байт-код, який виконує віртуальна машина Java (Java Virtual Machine, JVM). ",
      "moreDetails": "Приблизно на 9 з 10 комп’ютерах у США встановлена віртуальна Java-машина, і на 97 % корпоративних комп’ютерів використовується ця мова.\nСпершу Java створювався для інтерактивного ТБ, але індустрія кабельного телебачення була недостатньо розвинена для того, щоб використати її.\nМова розроблялася Джеймсом Гослінгом (James Gosling) і спочатку була названа Oak на честь дуба, який ріс біля офісу Гослінга. Згодом мову перейменували на Green, а пізніше вона набула назви Java, і використовувалася для написання клієнтських додатків і серверного програмного забезпечення. Своїй останній назві мова завдячує торговій марці кави Java, тому на офіційній емблемі зображена філіжанка з кавою, що парує. Відома й інша версія походження назви, пов’язана з алюзією на каву-машину як приклад побутового пристрою, для програмування якого спочатку створювалася мова. Зараз розвиток Java контролює Oraсle, яка купила компанію Sun 2010 року.\nСередня зарплата Java-розробника $83 975. По всьому світу налічується близько 9 млн Java- програмістів.\nЗгідно з даними сайту Tiobe.com, Java посідає друге місце серед найпопулярніших мов програмування. Перше місце віддане мові С.\nГоловну технологію Java -бібліотеку для модульного тестування ПЗ JUnit – використовують 4 з 5 програмістів. На другому місці Jenkins – його використовують 70 % розробників.\nJava Platform Standard Edition 8 – останній і головний реліз Java. Його особливості – підвищена ефективність розробки і продуктивність додатків завдяки зменшеній кількості стандартних вставок, поліпшеним колекціям і приміткам.\nДюк (Duke), символ Java, був створений Джо Пелренгом (Joe Palrang), який згодом працював над популярними анімаційними фільмами, такими як Шрек.",
      "image": "https://www.freeshows.ru/i/news/img20201207_003.jpg"
    },
    {
      "id": 5,
      "topic": {
        "id": 5,
        "topicName": "rating"
      },
      "titleName": "Рейтинг мов програмування 2020",
      "details": "Бачимо, що JavaScript нарешті суттєво випередив Java і став найпопулярнішою мовою програмування. Також серед нових мов слід звернути увагу на Dart — він одразу зайняв, не сказати щоби велику, але досить помітну нішу.",
      "moreDetails": "Тут важко не відмітити падіння популярності JVM та ріст JS-екосистеми (JavaScript, TypeScript). Схоже, на серверах JVM стек поступається Node.js. А от темпи зменшення популярності C# призупинилися — можливо, це пов’язано з розповсюдженням .NET Core — відкритого кросплатформного райнтайму, який знімає для користувачів проблему «прив’язки до вендору».\n\nТакож цікава ситуація у світі мобільної розробки: частка Swift незначно зменшується, Kotlin — незначно росте, коли, з іншого боку, mobile first для бізнесу вже традиційна практика. Можна припустити, що в мейнстрім пішли кросплатформні фреймворки (ті ж React Native й Flutter), а нативні мови використовуються більше для системних задач.\n\nДавайте подивимось на те, які зміни є статистично значущими в порівнянні з попереднім роком:\n\nРіст: Python, TypeScript, Dart, і... чомусь 1C.\nСпад: Java, PHP, Objective-C та Scala.\nЦікаво, що в порівнянні з 2017 роком, статистично значущі зміни майже ті ж.\n\nЩодо Scala, мені здається, що тут є частка «обережності» старту проекту перед виходом Scala 3.0 (він же Dotty). До речі, Dotty — дійсно нова мова й абсолютно фантастична (приходьте на ScalaUA).\n\nЗазначимо, що майже 8% респондентів використовують декілька мов у якості основних.",
      "image": "https://s.dou.ua/img/announces/image_23.png"
    },
    {
      "id": 6,
      "topic": {
        "id": 1,
        "topicName": "start"
      },
      "titleName": "Будуємо шлях в ІТ: з чого почати",
      "details": "IT-сфера набула великої популярності серед сучасної молоді при виборі професійного спрямування. За роботу в ІТ-компаніях змагаються найсвітліші голови та найперспективніші випускники престижних ВНЗ. Це зовсім не дивно, адже ця сфера готова запропонувати кмітливим кандидатам конкурентну заробітну плату та комфортні умови роботи з можливістю працювати дистанційно, що в умовах нової нормальності особливо актуально.",
      "moreDetails": "Regional Director у Luxoft, a DXC Technology Company Марія Кот пропонує свій список рекомендацій для початківців:\n\nРозвивайте професійні навички, проте не лише в ключовій для вас сфері чи технології, але й у суміжних. Це дозволить більш ефективно і швидко вирішувати завдання та більш комплексно бачити проблеми і способи їх вирішення. \nРозвивайте навички командної роботи у різних контекстах. Сучасні виклики в IT доволі складні. Їхнє вирішення потребує мультидисциплінарних підходів, різного досвіду та експертизи, а отже і різноманітного та інклюзивного підходу до формування команд — як у географічному, так і культурному та віковому аспектах. Сповна зрозуміти, як формуються та працюють команди, ви зможете на власному досвіді, тому ранній старт дасть вам багато можливостей у майбутній кар’єрі.  \nРозвивайте креативність та гнучкість розуму. Сучасний світ має так багато невизначеності, що стандартні підходи або ті, що базуються на попередньому досвіді, не завжди спрацьовують. Використовуйте інструменти, які дозволяють розвивати образне та нестандартне мислення. Багато цікавого можна знайти в художній літературі та мистецтві.\nРозвивайте soft skills. З кожним роком стає все більш очевидним, що в IT важливо не тільки те, наскільки ви підковані технічно, а й ваше вміння спілкуватися і вибудовувати стосунки в команді. Вчіться будувати партнерські взаємовідносини з іншими студентами та викладачами, колегами, клієнтами, в особистих стосунках. Хороші взаємини, незалежно від сфери, зазвичай засновані на «win-win» підході, довірі та етичній поведінці.\nСформуйте у себе звичку постійно вчитися. Технології не стоять на місці, тож будьте готові, що й вам доведеться розвиватись разом з ними. Слідкуйте за новинами конкретної області, трендами інженерії та світу технологій загалом. Курси, навчальні програми, вебінари, блоги — у вільному доступі є безліч інформації для постійного вдосконалення. Також важливо застосовувати набуті навички на практиці, відтак використовуйте кожну нагоду, щоб закріпити здобуті знання.",
      "image": "https://lms.beetroot.academy:3005/pub/597f973d-7bef-4be1-86ef-b4405594523d.png"
    },
    {
      "id": 7,
      "topic": {
        "id": 4,
        "topicName": "java"
      },
      "titleName": "Історія створення Java",
      "details": "Привіт сьогоднішня публікація буде стосуватись ще одної технології, яку застосовують в розробці сайту. Це мова програмування JAVA. Мова програмування JAVA доволі складна мова, її в принципі можна використовувати в багатьох випадках.",
      "moreDetails": "Джеймс Гослінг почав розробляти проект мови програмування  JAVA   в липні 1991 року, для використання його в одному із своїх багаточисельних проектів set – top box. Мова спочатку називалась Oak “Дуб” на честь дуба, який ріс перед офісом Гослінга, але в кінці вибір був зупинений на   JAVA, назва була вибрана із списку випадковим чином.\n\nГослінг вирішив запропонувати як додаток до віртуальної машини, яка буде мати стиль С С++. Sun випустила свій продукт під іменем  JAVA 1.0. Девіз звучав ( пишеш один раз запускаєш всюди). Слід відзначити і налаштовану безпеку, яка дозволяє використовувати межу на рівні файлів доступа.\n\nБільшість веб–браузерів  володіли можливістю запускати  JAVA– аплети (програмні компонети в двоїчному коді які виконуються в вікні браузера) на веб–сторінках. Завдяки всьому цьому  JAVA в дуже короткий час стала дуже популярною мовою.\n\nВ грудні 1998 року появилась  JAVA 2. Нова версія пропонувала більшість конфігурацій, створених спеціально для різних типів платформ, наприклад JDEE додаток типу enterprise в той же час як stripped+down Sun МE  був придуманий для мобільних платформ. \n\nSun переімінувала нові версії JD2 наступним чином: JAVA EE; JAVA ME; JAVA SE;  \n\nJAVA залишається стандартом, яким керується  JAVA Community Process (процес який дозволяє заінтересованим лицям приймати участь у формуванні майбутніх специфікацій JAVA). Sun запропонувала більшість частин JAVA безкоштовно, незалежно на статус власника програмного забезпечення. Доходи від JAVA поступають за рахунок продажі спецалізованих продуктів, таких як Enterprise Java System.\n\n13 листопада 2006 року Sun запустила декілька програм JAVA в виді програмного забезпечення, з відкритим вихідним кодом під ліцензією  GNU General Public License (ліцензія на вільне програмне забезпечення).\n\n8 травня 2008 року Sun завершила процес, який зробив придатним для використання всі коди ядра JAVA, з умовою розпоширення вільного програмного забезпечення з відкритим кодом, крім невеликої частини коду, на яку  Sun розширює свої права.\n\n",
      "image": "https://www.osp.ru/FileStorage/DOCUMENTS_ILLUSTRATIONS/13230112/original.jpg"
    },
    {
      "id": 8,
      "topic": {
        "id": 3,
        "topicName": "python"
      },
      "titleName": "PYTHON для дітей",
      "details": "Веселий вступ до програмування",
      "moreDetails": "Програмуйте із задоволенням! Ця книжка легко та невимушено допоможе вивчити основи однієї з найпопулярніших сучасних мов програмування – Python, що завдяки простому і зрозумілому синтаксису особливо пасує для новачків. Крок за кроком, на простих та дотепних прикладах та з допомогою смішних завдань ви зможете пізнати тонкощі мови Python. Навчитеся використовувати основні елементи цієї мови – списки, функції, модулі, малювати вбудованими інструментами Python та анімувати зображення і навіть зможете написати дві справжні комп’ютерні гри: забавку з м’ячем «Скок!» та бродилку «Містер Руки-палички біжить до виходу».",
      "image": "https://media.proglib.io/wp-uploads/2018/09/maxresdefault-1.jpg"
    },
    {
      "id": 9,
      "topic": {
        "id": 2,
        "topicName": "webDevelopment"
      },
      "titleName": "Хто такий web-розробник?",
      "details": "На питання «ким є web-розробник» можна відповісти по-різному. Якщо бути дуже лаконічним, то web-розробники – це ті, хто створює і підтримує веб-сайти. У більш широкому розумінні web-розробник – це фахівець в області комп’ютерних технологій, а саме web-програмування. Його покликання – втілити в життя проекти дизайнерів, створивши сайт, який відмінно функціонує.",
      "moreDetails": "Обов’язки web-розробника\n\nВаше завдання, як людини з дипломом бакалавра, полягає в тому, щоб надавати сервіси та продукти клієнта куди більш широкої аудиторії.\n\nТакож й буде необхідність в створенні цікавих та функціональних сайтів. Ймовірно, на ваші плечі ляже нелегке завдання пошуку цільової аудиторії. Можливо навіть вам доведеться проводити зустрічі з клієнтами і вислуховувати їхні побажання і вимоги до веб-сайту. Вас попросять проектувати зовнішній вигляд сайту, створити привабливу головну сторінку і доброзичливий до користувача дизайн.\n\nПісля створення сайту потрібно переконатися, що він працює на всіх можливих платформах і у всіх браузерах. Клієнт має право вимагати вносити зміни на сайт, включивши особливі інтерактивні можливості, використавши одну з мов програмування (Visual Basic, Java та інші).\n\nДе зазвичай працюють web-розробники?\n1\nДипломований фахівець, з хорошим досвідом і знаннями може претендувати на престижну роботу в великих компаніях і міжнародних корпораціях. Але web-розробники потрібні абсолютно всім. Як правило, від вас вимагатимуть близько 40 годин зайнятості на тиждень (якщо тільки ви не фрілансер).\n\nСтабільність роботи сайтів часом не так вже й просто вгадати – можливо вам доведеться працювати у вихідні і не в робочий час.\n\nЩо потрібно, для того, щоб стати хорошим web-розробником?\n\nНасправді нічого. Крім вашого бажання. Зрозуміло, для оволодіння спеціальністю потрібно знати, як працюють технології, комп’ютери та веб-сервери. Не буде зайвим і знання багатьох мов програмування, веб-додатків і багато чого іншого.\n\nСфера web-розробки – одна з найбільш клієнтоорієнтованих і проектооріентірованних сфер, де потрібно чітко знати свою роботу, встановлювати терміни і дедлайни. Тому вміння ефективно спілкуватися та планувати явно не буде зайвим.\n\nАле як бути, якщо ви взагалі нічого не знаєте про web-програмування, але дуже хочете їм стати? Куди наприклад, можна поступити в Києві?\n\nМожливо, ви будете приємно здивовані, але почати вчитися web-програмуванню можна прямо після 9 класу. Коледж Київського інституту бізнесу і технологій дає прекрасну можливість якісно і в невеликі терміни освоїти таку важливу і необхідну для інформаційної ери професію.\n\nМи пропонуємо індивідуальний підхід до кожного студента, практичні завдання та кейси, максимальне фокусування на набутті практичних навичок. Ми зможемо дати вам ті знання, які необхідні в століття Hi-teсh.\n\nУ сучасному світі інформаційні технології розвиваються дуже стрімко. Наше завдання – навчити гнучкості в пошуку нової інформації і постійно вчитися. Відеокурси, лекції та воркшопи, які пропонують наші викладачі створять фундамент знань висококласному web-розробнику. З такими знаннями наші бакалаври завжди знайдуть роботу.",
      "image": "https://media.bitdegree.org/storage/media/images/2018/08/what-is-a-web-developer.jpg"
    }
  ]
}